Yes, it is possible to maintain the PC version of a game while adding cross-platform compatibility for mobile devices. Here are some key considerations and steps to achieve this:

### 1. **Separate Codebase or Unified Codebase**
   - **Separate Codebase**: You can maintain a separate version for PC and mobile, allowing you to optimize each for their respective platforms. This can lead to more confusion in terms of updates and maintenance.
   - **Unified Codebase**: Using a single codebase that adapts to different platforms can reduce confusion and streamline updates. Frameworks like Unity or Unreal Engine support cross-platform development.

### 2. **Responsive Design**
   - **Aspect Ratio and Layout**: Implement a responsive design that adjusts the UI elements based on the screen size. This includes scaling the sidebar and other UI components to fit different resolutions.
   - **Flexible UI**: Use layout managers or anchors that allow UI elements to reposition and resize dynamically based on the screen dimensions.

### 3. **Input Handling**
   - **Control Schemes**: Adapt the control scheme for mobile devices (touch controls) while keeping the PC controls intact (keyboard/mouse). This may require additional logic to handle different input methods.

### 4. **Performance Optimization**
   - **Resource Management**: Ensure that the game runs efficiently on both platforms. Mobile devices may have limited resources compared to PCs, so optimizing graphics and performance is crucial.

### 5. **Testing Across Platforms**
   - **Cross-Platform Testing**: Regularly test the game on both PC and mobile devices to ensure that gameplay, UI, and performance are consistent and functional.

### 6. **User Experience Considerations**
   - **Consistent Experience**: Aim for a consistent user experience across platforms, but be aware that some features may need to be adjusted or omitted for mobile due to hardware limitations.
   - **Tutorials and Onboarding**: Provide clear tutorials for mobile users, as they may be unfamiliar with controls that differ from traditional PC gaming.

### 7. **Version Control and Updates**
   - **Version Management**: Keep track of changes and updates separately for PC and mobile if using separate codebases. If using a unified codebase, ensure that updates are compatible across platforms.

### Confusion Factors
- **Development Complexity**: Managing different input methods, UI layouts, and performance optimizations can increase complexity, leading to potential confusion among developers.
- **User Expectations**: Players may have different expectations based on the platform they are using. Ensuring that the game feels native to each platform is essential to avoid confusion.
- **Testing and Bug Fixes**: Bugs may manifest differently on each platform, requiring thorough testing and potentially leading to confusion if not properly documented.

### Conclusion
While it is feasible to keep the PC version unchanged and add mobile compatibility, careful planning and execution are essential to minimize confusion. A unified codebase with responsive design principles can help streamline the process, but it will require diligent testing and optimization to ensure a smooth experience across platforms.