Yes, it is possible to maintain the PC version of a game unchanged while adding cross-platform compatibility for mobile devices. Here are some key considerations and steps to achieve this:

### 1. **Separate Builds for PC and Mobile:**
   - **Maintain the PC Version:** Keep the existing PC version intact to avoid disrupting the current user experience.
   - **Create a Mobile Version:** Develop a separate build for mobile devices that can be optimized for touch controls and smaller screens.

### 2. **Responsive Design:**
   - **Aspect Ratio Adjustments:** Implement a responsive UI that adjusts based on the screen size and aspect ratio. This can involve using flexible layouts that adapt to different resolutions.
   - **Dynamic Sidebars:** Design sidebars and other UI elements to resize or reposition based on the screen dimensions. This can be achieved using relative positioning and scaling techniques.

### 3. **Cross-Platform Compatibility:**
   - **Input Handling:** Ensure that the game can handle different input methods (mouse/keyboard for PC, touch controls for mobile). This may require creating a new input system or adapting the existing one.
   - **Networking:** If the game has multiplayer features, ensure that the networking code supports cross-platform play.

### 4. **User Experience Considerations:**
   - **Control Scheme:** Mobile users will need a different control scheme than PC users. Consider implementing virtual buttons or gestures that are intuitive for mobile gameplay.
   - **Performance Optimization:** Mobile devices may have different performance capabilities compared to PCs. Optimize graphics and performance for mobile to ensure a smooth experience.

### 5. **Testing and Feedback:**
   - **User Testing:** Conduct thorough testing on both platforms to identify any usability issues or bugs. Gather feedback from users on both PC and mobile to refine the experience.
   - **Iterate Based on Feedback:** Be prepared to make adjustments based on user feedback to ensure that both versions provide a satisfying experience.

### 6. **Potential Confusion:**
   - **User Interface Differences:** If the UI is significantly different between platforms, users may find it confusing. Aim for a consistent design language across both versions while adapting to the strengths of each platform.
   - **Gameplay Mechanics:** Ensure that gameplay mechanics are intuitive and accessible on both platforms. Avoid overly complex controls that may not translate well to mobile.

### Conclusion:
While it is feasible to keep the PC version unchanged and add mobile compatibility, careful planning and execution are essential to minimize confusion and ensure a seamless experience across platforms. By focusing on responsive design, user experience, and thorough testing, you can create a successful cross-platform game.